#Область ПрограммныйИнтерфейс

Процедура ОбновитьНастройкиКаналовChat2Desk() Экспорт
	
	ДанныеПоКаналам = ИнтеграцияChat2Desk_20.ДанныеПоКаналам();
	
	Если ДанныеПоКаналам <> Неопределено Тогда
		
		Для Каждого ИнформацияПоКаналу Из ДанныеПоКаналам Цикл
			
			НомерТелефона = ИнформацияПоКаналу.Получить("phone");
			
			НастройкаНомера = Справочники.НастройкиНомеровТелефонов.НайтиПоРеквизиту("НомерТелефона", НомерТелефона);
			
			Если ЗначениеЗаполнено(НастройкаНомера) Тогда
				
				НастройкаОбъект = НастройкаНомера.ПолучитьОбъект();
				НастройкаОбъект.channel_id = ИнформацияПоКаналу.Получить("id");
				
				НастройкаОбъект.ВариантыТранспортаСообщенийChat2Desk.Очистить();
				
				ВариантыТранспорта = ИнформацияПоКаналу.Получить("transports");
				
				Для Каждого Транспорт Из ВариантыТранспорта Цикл
					
					НоваяСтрока = НастройкаОбъект.ВариантыТранспортаСообщенийChat2Desk.Добавить();
					НоваяСтрока.transport = Транспорт;
					
				КонецЦикла;
				
				НастройкаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
