
// Описание АПИ: https://app.swaggerhub.com/apis-docs/vasdmi666/test_task_1/1.0.0

Функция TariffTypesGET(Запрос)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТР_ВидыТарифов.Ссылка КАК Ссылка,
	|	ТР_ВидыТарифов.Наименование КАК Наименование,
	|	ТР_ВидыТарифов.Комментарий КАК Комментарий,
	|	ТР_ВидыТарифов.Стоимость КАК Стоимость
	|ИЗ
	|	Справочник.ТР_ВидыТарифов КАК ТР_ВидыТарифов
	|ГДЕ
	|	НЕ ТР_ВидыТарифов.ПометкаУдаления");
	
	ВыборкаТарифов = Запрос.Выполнить().Выбрать();
	
	МассивДанных = Новый Массив();
	
	Пока ВыборкаТарифов.Следующий() Цикл
		
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("id", XMLСтрока(ВыборкаТарифов.Ссылка));
		СтруктураСтроки.Вставить("name", ВыборкаТарифов.Наименование);
		СтруктураСтроки.Вставить("description", ВыборкаТарифов.Комментарий);
		СтруктураСтроки.Вставить("price", ВыборкаТарифов.Стоимость);
		
		МассивДанных.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивДанных);
	
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(
		ТелоОтвета,
		КодировкаТекста.UTF8,
		ИспользованиеByteOrderMark.НеИспользовать);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;
	
КонецФункции
